#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-ubHiqviPtMpc19Yw

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_eip.natgw_eip: Refreshing state... [id=eipalloc-0caa4fb94cb4971d9]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e9b3892f4f02491c]
aws_iam_role.db_init_role: Refreshing state... [id=db_init_role]
aws_efs_file_system.nuclei_efs: Refreshing state... [id=fs-00cd02fe9fbaf7a9a]
aws_lambda_layer_version.boto3_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:4]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_sqs_queue.crawled_urls: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls]
aws_default_vpc.default: Refreshing state... [id=vpc-00316a594b8442850]
aws_iam_role.scanner_role: Refreshing state... [id=scanner_role]
aws_apigatewayv2_api.lambda: Refreshing state... [id=mnn47ekvw8]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-07e4aca6461e65ec9]
aws_iam_policy.sqs_publish_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/sqs_publish_policy]
aws_efs_access_point.nuclei_efs_access_point: Refreshing state... [id=fsap-09706ceeb283da7f4]
aws_iam_role_policy_attachment.db_init_policy_attach_lambda_basic: Refreshing state... [id=db_init_role-20220620061502455000000003]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220620061502436700000002]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_iam_role_policy_attachment.scanner_policy_attach_efs_access: Refreshing state... [id=scanner_role-20220620061502561500000006]
aws_iam_role_policy_attachment.scanner_policy_attach_vpc_access: Refreshing state... [id=scanner_role-20220620061502565800000007]
aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic: Refreshing state... [id=scanner_role-20220620061502637000000009]
aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution: Refreshing state... [id=scanner_role-20220620061502598600000008]
aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish: Refreshing state... [id=crawler_role-2022062006152872580000000a]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_iam_role_policy_attachment.crawler_policy_attach_readonly: Refreshing state... [id=crawler_role-20220620061502536700000005]
aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic: Refreshing state... [id=crawler_role-20220620061502490300000004]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=sch06ac]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=vugmn2e]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_subnet.private_az1: Refreshing state... [id=subnet-052b710a3fb7476e2]
aws_subnet.private_az2: Refreshing state... [id=subnet-043ce8e346211a36c]
aws_route_table.private_rt: Refreshing state... [id=rtb-0ace0b8eb6a658e94]
aws_default_security_group.default: Refreshing state... [id=sg-0dfa3e4d75f7cdb3a]
aws_route_table_association.subnet2_rt: Refreshing state... [id=rtbassoc-0c55e3ecdf6c3fc2c]
aws_route_table_association.subnet1_rt: Refreshing state... [id=rtbassoc-0b3085b17975cec92]
aws_db_subnet_group.private: Refreshing state... [id=private]
aws_efs_mount_target.nuclei_efs_mount_target2: Refreshing state... [id=fsmt-036f87c58caef165e]
aws_efs_mount_target.nuclei_efs_mount_target1: Refreshing state... [id=fsmt-059c1446d54fbf482]
aws_rds_cluster.vuln_db_cluster: Refreshing state... [id=vuln-db-cluster]
aws_iam_policy.rds_connect_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/rds_connect_policy]
aws_rds_cluster_instance.vuln_db_instance: Refreshing state... [id=tf-2022062006160966580000000b]
aws_lambda_function.scanner: Refreshing state... [id=scanner]
aws_iam_role_policy_attachment.db_init_policy_attach_rds_access: Refreshing state... [id=db_init_role-2022062006160984810000000c]
aws_iam_role_policy_attachment.scanner_policy_attach_rds_access: Refreshing state... [id=scanner_role-2022062006160985230000000d]
aws_cloudwatch_log_group.scanner: Refreshing state... [id=/aws/lambda/scanner]
aws_lambda_event_source_mapping.example: Refreshing state... [id=7da72925-389e-4ed5-b750-bd763143d6b4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.db_init will be created
  + resource "aws_cloudwatch_log_group" "db_init" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/db_init"
      + retention_in_days = 3
      + tags_all          = (known after apply)
    }

  # aws_iam_role_policy_attachment.db_init_policy_attach_vpc_access will be created
  + resource "aws_iam_role_policy_attachment" "db_init_policy_attach_vpc_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "db_init_role"
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-20T06:15:28.383+0000" -> (known after apply)
      ~ source_code_hash               = "u1G0VSwTMrVs8c+fufY6t3aKlPK35bRQZzd5RdXDdq8=" -> "SXqaDI+xVsHoa4ZPzfNTrn8YAA1QaJChxU/+8370J4g="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db_init will be created
  + resource "aws_lambda_function" "db_init" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "artifacts/db_init.zip"
      + function_name                  = "db_init"
      + handler                        = "package.db_init.lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:4",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::847035122536:role/db_init_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "+vvfN/1IlGZixdXubwRCDwHedC4QWfjT5D0KXUc/7Xs="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "APP_DB_NAME" = "vuln_db"
              + "DB_HOST"     = "vuln-db-cluster.cluster-ci1sahf4rlmb.us-west-2.rds.amazonaws.com"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dfa3e4d75f7cdb3a",
            ]
          + subnet_ids         = [
              + "subnet-043ce8e346211a36c",
              + "subnet-052b710a3fb7476e2",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_function.scanner will be updated in-place
  ~ resource "aws_lambda_function" "scanner" {
        id                             = "scanner"
      ~ last_modified                  = "2022-06-20T06:21:09.838+0000" -> (known after apply)
      ~ source_code_hash               = "pHOfkNrsQWp9li4puGWQoZM4kHJT4kncLXy9B6jxiKk=" -> "lL8Wg6GDwMmNSWCnchhobLc4vxmOpZnef6kfVZwU6nk="
        tags                           = {}
        # (18 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-20T06:15:24.595+0000" -> (known after apply)
      ~ source_code_hash               = "qZylJqZ9/ypBTJS9nmGn0Q9GOhLOYd6ZhdpBd9lwKnQ=" -> "fIL7ka0Bxgxy6PL45+T9At3vpudolROfA4VYOD4jzws="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_invocation.db_init will be created
  + resource "aws_lambda_invocation" "db_init" {
      + function_name = "db_init"
      + id            = (known after apply)
      + input         = jsonencode(
            {
              + key1 = "value1"
            }
        )
      + qualifier     = "$LATEST"
      + result        = (known after apply)
    }

Plan: 4 to add, 3 to change, 0 to destroy.


```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*